app/views/movies/show.html.erb

  <p>
    <%= link_to pluralize(@movie.reviews.count,'Review'), movie_reviews_path(@movie)%>
---
SELECT COUNT(*) FROM "reviews"  WHERE "reviews"."movie_id" = ?  [["movie_id", 3]]